app/admin/routes.rb

  show do
    attributes_table do
    row 'station' do |route|
      route.stations.any? ?route.stations.map { |station| "&bull; #{station.station_name}" }.join('<br>').html_safe : content_tag(:span, 'N.A.')
---
SELECT "stations".* FROM "stations" WHERE "stations"."route_id" = $1  [["route_id", 34]]
SELECT 1 AS one FROM "stations" WHERE "stations"."route_id" = $1 LIMIT $2  [["route_id", 34], ["LIMIT", 1]]