app/admin/stations.rb

      f.input :departure
      f.input :distance
      f.input :seats
      f.input :route_id, lable:'train', as: :select, collection: Route.all.collect{|r| [r.name,r.id] },include_blank: "select train "
---
SELECT "routes".* FROM "routes"