app/admin/tickets.rb

SELECT "passengers".* FROM "passengers" WHERE "passengers"."ticket_id" = $1  [["ticket_id", 15]]
SELECT 1 AS one FROM "passengers" WHERE "passengers"."ticket_id" = $1 LIMIT $2  [["ticket_id", 15], ["LIMIT", 1]]
---
  show do
    attributes_table do
    row 'passenger' do |ticket|
      ticket.passengers.any? ?ticket.passengers.map { |passenger| "&bull; #{passenger.name}" }.join('<br>').html_safe : content_tag(:span, 'N.A.')