app/views/tickets/show.html.erb

SELECT "passengers".* FROM "passengers" WHERE "passengers"."ticket_id" = $1  [["ticket_id", 15]]
---
  <tbody>
    <% @ticket.passengers.each do |passenger| %>