app/controllers/passengers_controller.rb

  def index
    @passengers = Passenger.all
    @ticket = Ticket.find(params[:ticket_id])
---
SELECT "passengers".* FROM "passengers"
SELECT "tickets".* FROM "tickets" WHERE "tickets"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def create
    ticket = Ticket.find(params[:ticket_id])
    @passenger = ticket.passengers.new(passenger_params)
     if @passenger.save
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "passengers" ("name", "age", "mobile", "gender", "ticket_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"