app/controllers/tickets_controller.rb

SELECT "tickets".* FROM "tickets" WHERE "tickets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "stations".* FROM "stations" WHERE "stations"."station_name" = $1 LIMIT $2  [["station_name", "indore"], ["LIMIT", 1]]
SELECT "stations".* FROM "stations" WHERE "stations"."station_name" = $1 LIMIT $2  [["station_name", "bhopal"], ["LIMIT", 1]]
SELECT COUNT(*) FROM "passengers" WHERE "passengers"."ticket_id" = $1  [["ticket_id", 15]]
---
  def show
    @ticket = Ticket.find(params[:id])
    @from = @ticket.from
    @to = @ticket.to
    @date = @ticket.date
    a = Station.find_by(station_name:@from)
    b = Station.find_by(station_name:@to)
    @total_distance = b.distance - a.distance
    @total_passenger = @ticket.passengers.count

SELECT "routes".* FROM "routes" WHERE "routes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "tickets" ("from", "to", "date", "mobile", "email", "route_id", "created_at", "updated_at", "pnr") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    route = Route.find(params[:route_id])
    @ticket = route.tickets.new(ticket_params)
    @pnr = rand.to_s[2..7]
     if @ticket.save